app/controllers/foods_controller.rb

INSERT INTO "foods" ("question", "option1", "option2", "option3", "option4", "ans", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @food = Food.new(food_params)

    respond_to do |format|
      if @food.save