app/controllers/minions_controller.rb

  def index
    @minions = Minion.all
---
SELECT "minions".* FROM "minions"

  def create
    @minion = Minion.new(minion_params)

    respond_to do |format|
      if @minion.save
---
INSERT INTO "minions" ("question", "option1", "option2", "option3", "option4", "ans", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_minion
      @minion = Minion.find(params[:id])
---
SELECT  "minions".* FROM "minions" WHERE "minions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]