app/controllers/sports_controller.rb

SELECT "sports".* FROM "sports"
---
  def index
    @sports = Sport.all

INSERT INTO "sports" ("question", "option1", "option2", "option3", "option4", "ans", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @sport = Sport.new(sport_params)

    respond_to do |format|
      if @sport.save

SELECT  "sports".* FROM "sports" WHERE "sports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_sport
      @sport = Sport.find(params[:id])