app/controllers/teches_controller.rb

  def index
    @teches = Tech.all
---
SELECT "teches".* FROM "teches"

  def create
    @tech = Tech.new(tech_params)

    respond_to do |format|
      if @tech.save
---
INSERT INTO "teches" ("question", "option1", "option2", "option3", "option4", "ans", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_tech
       @tech = Tech.find(params[:id])
---
SELECT  "teches".* FROM "teches" WHERE "teches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]